---
kind: property
id: P:Autodesk.Revit.UI.TextBox.SelectTextOnFocus
source: html/719fcbc6-4941-ef40-0ec9-aff133875c63.htm
---
# Autodesk.Revit.UI.TextBox.SelectTextOnFocus Property

A value that indicates if the text is selected when the text box gains focus.

## Syntax (C#)
```csharp
public bool SelectTextOnFocus { get; set; }
```

## Remarks
If the value is true all the text in the text box will be selected when the text box gets keyboard
focus. If it is false the text is not selected. The default value is false.